Repository: tobagin/Tempo
Catalog: po/*_complete.po
Languages: it

source: A precise and professional metronome application
it: Un'applicazione metronomo precisa e professionale

source: Italian: Albano Battistella (github.com/albanobattistella) Turkish: Erdem Uygun (github.com/erdemuygun)
it: Italiano: Albano Battistella (github.com/albanobattistella) Turco: Erdem Uygun (github.com/erdemuygun)

source: Start
it: Avvia

source: Stop
it: Ferma

source: Keyboard Shortcuts
it: Scorciatoie da Tastiera

source: Quick reference for keyboard shortcuts
it: Riferimento rapido per le scorciatoie da tastiera

source: <b>Playback Control:</b> • <b>Spacebar</b> - Start/Stop metronome • <b>Escape</b> - Stop metronome • <b>T</b> - Tap tempo <b>Tempo Adjustment:</b> • <b>↑/↓ Arrow</b> - Adjust tempo (±1 BPM) • <b>←/→ Arrow</b> - Adjust tempo (±1 BPM) • <b>Shift + Arrows</b> - Adjust tempo (±10 BPM) • <b>+/-</b> - Adjust tempo (±5 BPM) • <b>Shift + +/-</b> - Adjust tempo (±10 BPM) <b>Time Signature:</b> • <b>Ctrl + 1-9</b> - Set beats per bar • <b>Ctrl + R</b> - Reset beat counter <b>Help:</b> • <b>F1</b> - Show this help
it: <b>Controllo Riproduzione:</b> • <b>Barra Spaziatrice</b> - Avvia/Ferma metronomo • <b>Escape</b> - Ferma metronomo • <b>T</b> - Tap tempo <b>Regolazione Tempo:</b> • <b>Freccia ↑/↓</b> - Regola tempo (±1 BPM) • <b>Freccia ←/→</b> - Regola tempo (±1 BPM) • <b>Shift + Frecce</b> - Regola tempo (±10 BPM) • <b>+/-</b> - Regola tempo (±5 BPM) • <b>Shift + +/-</b> - Regola tempo (±10 BPM) <b>Indicazione del Tempo:</b> • <b>Ctrl + 1-9</b> - Imposta battute per barra • <b>Ctrl + R</b> - Reset contatore battute <b>Aiuto:</b> • <b>F1</b> - Mostra questo aiuto

source: BPM must be between 40 and 240, got %d
it: Il BPM deve essere tra 40 e 240, ricevuto %d

source: Time signature numerator must be 1-16, got %d
it: Il numeratore dell'indicazione del tempo deve essere 1-16, ricevuto %d

source: Time signature denominator must be 2, 4, 8, or 16, got %d
it: Il denominatore dell'indicazione del tempo deve essere 2, 4, 8 o 16, ricevuto %d

source: Sound file chooser not yet implemented
it: Selettore file audio non ancora implementato

source: File chooser needs modern GTK4 implementation
it: Il selettore file necessita di un'implementazione GTK4 moderna

source: Metronome
it: Metronomo

source: Main Menu
it: Menu Principale

source: Time Signature
it: Indicazione del Tempo

source: Beat Indicator
it: Indicatore del Ritmo

source: Tap Tempo
it: Tocca Tempo

source: Tap repeatedly to set tempo
it: Tocca ripetutamente per impostare il tempo

source: Preferences
it: Preferenze

source: About Tempo
it: Informazioni su Tempo

source: Quit
it: Esci

source: Adjust click and accent volume levels
it: Regola i livelli di volume dei click e degli accenti

source: Click Volume
it: Volume Click

source: Volume for regular metronome clicks
it: Volume per i click regolari del metronomo

source: Accent Volume
it: Volume Accento

source: Volume for downbeat accent clicks
it: Volume per i click di accento del downbeat

source: Custom Sounds
it: Suoni Personalizzati

source: Use custom audio files for metronome sounds
it: Usa file audio personalizzati per i suoni del metronomo

source: Use Custom Sounds
it: Usa Suoni Personalizzati

source: Replace default click sounds with custom audio files
it: Sostituisce i suoni click predefiniti con file audio personalizzati

source: High Sound (Accent)
it: Suono Acuto (Accento)

source: Audio file for downbeat accent clicks
it: File audio per i click di accento del downbeat

source: Choose File...
it: Scegli File...

source: Low Sound (Regular)
it: Suono Grave (Regolare)

source: Audio file for regular metronome clicks
it: File audio per i click regolari del metronomo

source: Behavior
it: Comportamento

source: Configure tap tempo sensitivity and behavior
it: Configura la sensibilità e il comportamento del tap tempo

source: Tap Sensitivity
it: Sensibilità Tap

source: Milliseconds tolerance for tap tempo detection
it: Tolleranza in millisecondi per il rilevamento del tap tempo

source: Window Behavior
it: Comportamento Finestra

source: Configure application window behavior
it: Configura il comportamento della finestra dell'applicazione

source: Start Playing on Launch
it: Avvia Riproduzione all'Avvio

source: Automatically start the metronome when the app opens
it: Avvia automaticamente il metronomo quando l'app si apre

source: Keep Window on Top
it: Mantieni Finestra in Primo Piano

source: Keep the metronome window above other applications
it: Mantiene la finestra del metronomo sopra le altre applicazioni

source: Visual
it: Visuale

source: Theme
it: Tema

source: Choose the application appearance theme
it: Scegli il tema di aspetto dell'applicazione

source: Application Theme
it: Tema Applicazione

source: Select light, dark, or system theme
it: Seleziona tema chiaro, scuro o di sistema

source: Follow System
it: Segui Sistema

source: Light
it: Chiaro

source: Dark
it: Scuro

source: Configure visual beat indicator settings
it: Configura le impostazioni dell'indicatore visivo del ritmo

source: Show Beat Numbers
it: Mostra Numeri Battute

source: Display the current beat number during playback
it: Visualizza il numero della battuta corrente durante la riproduzione

source: Flash on Beat
it: Lampeggio su Battuta

source: Flash the beat indicator circle on each beat
it: Fa lampeggiare il cerchio dell'indicatore del ritmo ad ogni battuta

source: Highlight Downbeats
it: Evidenzia Downbeat

source: Use different color for downbeat (first beat of bar)
it: Usa un colore diverso per il downbeat (prima battuta della barra)

source: A modern metronome for musicians
it: Un metronomo moderno per musicisti

source: Tempo is a modern, feature-rich metronome application designed for musicians of all levels. Built with GTK4 and Libadwaita using Blueprint UI templates, it provides precise timing, comprehensive keyboard shortcuts, and a beautiful animated beat indicator.
it: Tempo è un'applicazione metronomo moderna e ricca di funzionalità progettata per musicisti di tutti i livelli. Costruita con GTK4 e Libadwaita usando template UI Blueprint, fornisce temporizzazione precisa, scorciatoie da tastiera complete e un bellissimo indicatore del ritmo animato.

source: Key features include GStreamer audio integration with distinct beat/downbeat sounds, customizable tempo (40-240 BPM), multiple time signatures, animated Cairo-based visual indicators with pulse effects, comprehensive preferences dialog, tap tempo functionality, and full keyboard control. The high-precision timing engine ensures professional accuracy.
it: Le caratteristiche principali includono integrazione audio GStreamer con suoni distinti di battuta/downbeat, tempo personalizzabile (40-240 BPM), indicazioni del tempo multiple, indicatori visivi animati basati su Cairo con effetti di pulsazione, finestra di preferenze complete, funzionalità tap tempo e controllo completo da tastiera. Il motore di temporizzazione ad alta precisione garantisce accuratezza professionale.

source: Main window showing tempo controls and beat indicator
it: Finestra principale che mostra i controlli del tempo e l'indicatore del ritmo

source: General preferences with audio and behavior settings
it: Preferenze generali con impostazioni audio e comportamento

source: Visual preferences with theme selection and beat indicator options
it: Preferenze visive con selezione del tema e opzioni dell'indicatore del ritmo

source: About dialog showing application information
it: Finestra Informazioni che mostra le informazioni dell'applicazione

source: metronome
it: metronomo

source: music
it: musica

source: timing
it: temporizzazione

source: practice
it: pratica

source: rhythm
it: ritmo

source: beat
it: battuta

source: Feature consolidation and stability improvements
it: Consolidamento funzionalità e miglioramenti di stabilità

source: Merged comprehensive improvements from feature branches
it: Fusione miglioramenti comprensivi dai rami funzionalità

source: Consolidated Blueprint UI template enhancements
it: Consolidamento miglioramenti template UI Blueprint

source: Integrated custom sound support capabilities
it: Integrazione capacità supporto suoni personalizzati

source: Improved code organization and maintainability
it: Migliorata organizzazione del codice e manutenibilità

source: Enhanced build system stability
it: Migliorata stabilità del sistema di build

source: Major update: Complete Vala metronome with comprehensive improvements
it: Aggiornamento maggiore: Metronomo Vala completo con miglioramenti comprensivi

source: Complete Python to Vala conversion for better performance and integration
it: Conversione completa da Python a Vala per migliori prestazioni e integrazione

source: GStreamer audio integration with distinct beat and downbeat sounds
it: Integrazione audio GStreamer con suoni distinti di battuta e downbeat

source: Blueprint UI templates with modern GTK4/Libadwaita design
it: Template UI Blueprint con design moderno GTK4/Libadwaita

source: Animated beat indicator with Cairo-based pulse effects and perfect sync
it: Indicatore del ritmo animato con effetti di pulsazione basati su Cairo e sincronizzazione perfetta

source: Comprehensive keyboard shortcuts for full application control
it: Scorciatoie da tastiera complete per il controllo completo dell'applicazione

source: Enhanced preferences dialog with Audio, Behavior, and Visual settings
it: Finestra preferenze migliorata con impostazioni Audio, Comportamento e Visive

source: Multi-language support with Italian and Turkish translations
it: Supporto multi-linguaggio con traduzioni italiana e turca

source: Improved timing engine with microsecond precision
it: Motore di temporizzazione migliorato con precisione al microsecondo

source: Larger beat indicator with dramatic glow effects
it: Indicatore del ritmo più grande con effetti di bagliore drammatici

source: Fixed beat sequence to proper 1-2-3-4 display
it: Corretta sequenza delle battute per visualizzazione corretta 1-2-3-4

source: Proper translator credits in about dialog
it: Crediti traduttori corretti nella finestra informazioni

source: Enable proper file picker portal integration
it: Abilita integrazione corretta del portale selettore file

source: Updated file chooser to use modern Gtk.FileDialog API
it: Aggiornato selettore file per usare API Gtk.FileDialog moderna

source: File picker now properly uses desktop environment portals
it: Il selettore file ora usa correttamente i portali dell'ambiente desktop

source: Improved security through sandboxed file access
it: Sicurezza migliorata attraverso accesso file in sandbox

source: Removed redundant portal permissions from Flatpak manifest
it: Rimossi permessi portale ridondanti dal manifesto Flatpak

source: Clean up version references and fix author information
it: Pulizia riferimenti versione e correzione informazioni autore

source: Updated all version references to use current version consistently
it: Aggiornati tutti i riferimenti versione per usare la versione corrente consistentemente

source: Fixed author information to use correct name throughout codebase
it: Corrette informazioni autore per usare il nome corretto in tutto il codice

source: Ensured only metainfo retains version history as intended
it: Assicurato che solo metainfo mantenga la cronologia versione come previsto

source: Add file picker portal support
it: Aggiunto supporto portale selettore file

source: Added proper file picker portal permissions to Flatpak manifest
it: Aggiunti permessi portale selettore file corretti al manifesto Flatpak

source: Improved security by using sandboxed file access
it: Sicurezza migliorata usando accesso file in sandbox

source: Enhanced compatibility with desktop file managers
it: Compatibilità migliorata con i gestori file desktop

source: Fix desktop file executable reference
it: Corretto riferimento eseguibile file desktop

source: Fixed desktop file to use correct executable name 'tempo' instead of application ID
it: Corretto file desktop per usare il nome eseguibile corretto 'tempo' invece dell'ID applicazione

source: Resolved application launch issues from desktop environment
it: Risolti problemi di avvio applicazione dall'ambiente desktop

source: Improved desktop integration and launcher compatibility
it: Migliorata integrazione desktop e compatibilità launcher

source: Improved metadata quality for better Flathub presentation
it: Migliorata qualità metadati per migliore presentazione Flathub

source: Streamlined description to be more concise and user-focused
it: Descrizione semplificata per essere più concisa e focalizzata sull'utente

source: Enhanced readability following Flathub quality guidelines
it: Leggibilità migliorata seguendo le linee guida qualità Flathub

source: Removed redundant technical details for better clarity
it: Rimossi dettagli tecnici ridondanti per maggiore chiarezza

source: Fix AppStream control redefinition warning
it: Corretto avviso ridefinizione controllo AppStream

source: Removed duplicate keyboard control from recommends section
it: Rimosso controllo tastiera duplicato dalla sezione raccomandazioni

source: Fixed AppStream validation warning about redefined relation items
it: Corretto avviso validazione AppStream su elementi relazione ridefiniti

source: AppStream metadata validation fixes
it: Correzioni validazione metadati AppStream

source: Fixed AppStream validation errors for Flathub submission
it: Corretti errori validazione AppStream per invio Flathub

source: Updated developer information and contact details
it: Aggiornate informazioni sviluppatore e dettagli contatto

source: Removed inapplicable metadata fields
it: Rimossi campi metadati non applicabili

source: Added proper branding colors
it: Aggiunti colori branding corretti

source: Screenshots and metadata update
it: Aggiornamento screenshot e metadati

source: Added application screenshots for better visibility
it: Aggiunti screenshot applicazione per migliore visibilità

source: Updated metadata with comprehensive visual previews
it: Aggiornati metadati con anteprime visive complete

source: Enhanced AppStream information for software centers
it: Migliorate informazioni AppStream per centri software

source: Initial release of Tempo metronome
it: Rilascio iniziale del metronomo Tempo

source: Precise timing engine with drift compensation
it: Motore di temporizzazione preciso con compensazione deriva

source: GTK4 and Libadwaita modern UI
it: UI moderna GTK4 e Libadwaita

source: Customizable tempo and time signatures
it: Tempo e indicazioni del tempo personalizzabili

source: Visual beat indicator with downbeat accents
it: Indicatore visivo del ritmo con accenti downbeat

source: Low-latency GStreamer audio
it: Audio GStreamer a bassa latenza

source: Tap tempo functionality
it: Funzionalità tap tempo

source: Keyboard shortcuts
it: Scorciatoie da tastiera

source: Settings persistence
it: Persistenza impostazioni
